
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДокументЧекККМ") Тогда
		ПолеЧека.Очистить();
		ПолеЧека.УстановитьТекст(Параметры.ДокументЧекККМ.ПолучитьТекст());
	КонецЕсли; 
	
	Если Параметры.Свойство("Интервал") Тогда
		Интервал = Параметры.Интервал;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкно()
	Закрыть();	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если ЗначениеЗаполнено(Интервал) Тогда
		ПодключитьОбработчикОжидания("ЗакрытьОкно", Интервал, Истина);	
	КонецЕсли;

КонецПроцедуры
