&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредварительныйЧек.Очистить();
	Если Параметры.Свойство("ПредварительныйЧек") Тогда 
		ЗаполнитьЗначенияСвойств(ПредварительныйЧек, Параметры.ПредварительныйЧек);
		ПредварительныйЧек.Вывести(Параметры.ПредварительныйЧек);	
	КонецЕсли; 
	
	Если Параметры.Свойство("XMLПредварительныйЧек") Тогда
		XMLПредварительныйЧек.УстановитьТекст(Параметры.XMLПредварительныйЧек);	
	КонецЕсли; 
	
	Если Параметры.Свойство("Интервал") Тогда
		Интервал = Параметры.Интервал;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыЧекаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОтключитьОбработчикОжидания("ЗакрытьОкно");
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкно()
	Закрыть();		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Интервал) Тогда
		ПодключитьОбработчикОжидания("ЗакрытьОкно", Интервал, Истина);	
	КонецЕсли;

КонецПроцедуры
