&Вместо ("ПолучитьОбъектДрайвера")
Функция ККТ_ПолучитьОбъектДрайвера(ДанныеДрайвера, ТекстОшибки = Неопределено)
	
	Если ДанныеДрайвера.ИдентификаторОбъекта = "Addin.KSOFT_EmulatorKKT" Тогда
		#Если ВебКлиент Тогда
			глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ЭмуляторKSOFT_ПодключаемоеОборудованиеВебКлиент);
		#Иначе  
			глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ЭмуляторKSOFT_ПодключаемоеОборудованиеКлиент);	
		#КонецЕсли 	
	КонецЕсли;
	
	Возврат ПродолжитьВызов(ДанныеДрайвера, ТекстОшибки);
	
КонецФункции

&Перед ("НачатьПолучениеОбъектаДрайвера")
Процедура ККТ_НачатьПолучениеОбъектаДрайвера(ОповещениеПриЗавершении, ДанныеДрайвера)
	Если ДанныеДрайвера.ИдентификаторОбъекта = "Addin.KSOFT_EmulatorKKT" Тогда
		#Если ВебКлиент Тогда
			глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ЭмуляторKSOFT_ПодключаемоеОборудованиеВебКлиент);
		#Иначе  
			глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ЭмуляторKSOFT_ПодключаемоеОборудованиеКлиент);	
		#КонецЕсли 	
	КонецЕсли; 
КонецПроцедуры
