&Вместо ("ПолучитьОбъектДрайвера")
Функция ЭмуляторKSOFT_ПолучитьОбъектДрайвера(ДанныеДрайвера, ТекстОшибки = Неопределено)
	
	Если ЭмуляторKSOFT_ПодключаемоеОборудованиеКлиент.ПроверкаОборудованияПройдена(ДанныеДрайвера)  Тогда
		глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ЭмуляторKSOFT_ПодключаемоеОборудованиеКлиент.ОбъектДрайвераЭмулятор(ДанныеДрайвера));
	КонецЕсли; 
	
	Возврат ПродолжитьВызов(ДанныеДрайвера, ТекстОшибки);
	
КонецФункции

&Перед ("НачатьПолучениеОбъектаДрайвера")
Процедура ЭмуляторKSOFT_НачатьПолучениеОбъектаДрайвера(ОповещениеПриЗавершении, ДанныеДрайвера)
	Если ЭмуляторKSOFT_ПодключаемоеОборудованиеКлиент.ПроверкаОборудованияПройдена(ДанныеДрайвера) Тогда
		глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ЭмуляторKSOFT_ПодключаемоеОборудованиеКлиент.ОбъектДрайвераЭмулятор(ДанныеДрайвера));	
	КонецЕсли; 
КонецПроцедуры
