&Вместо ("ПолучитьОбъектДрайвера")
Функция ККТ_ПолучитьОбъектДрайвера(ДанныеДрайвера, ТекстОшибки = Неопределено)
	
	Если ДанныеДрайвера.ИдентификаторОбъекта = "Addin.KSOFT_EmulatorKKT" Тогда
		глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ЭмуляторKSOFT_ПодключаемоеОборудованиеКлиент);
	КонецЕсли;
	
	Возврат ПродолжитьВызов(ДанныеДрайвера, ТекстОшибки);
	
КонецФункции

&Перед ("НачатьПолучениеОбъектаДрайвера")
Процедура ККТ_НачатьПолучениеОбъектаДрайвера(ОповещениеПриЗавершении, ДанныеДрайвера)
	Если ДанныеДрайвера.ИдентификаторОбъекта = "Addin.KSOFT_EmulatorKKT" Тогда
		глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ЭмуляторKSOFT_ПодключаемоеОборудованиеКлиент);
	КонецЕсли; 
КонецПроцедуры
